//验证
var regexEnum={
    intege: "^-?[1-9]\\d*$", //整数
    intege1: "^[1-9]\\d*$", //正整数
    intege2: "^-[1-9]\\d*$", //负整数
    num: "^([+-]?)\\d*\\.?\\d+$", //数字
    num1: "^([+]?)\\d*\\.?\\d+$", //正数
    num2: "^-\\d*\\.?\\d+$", //负数
    decmal: "^([+-]?)\\d*\\.\\d+$", //浮点数
    decmal1: "^([+]?)\\d*\\.\\d+$", //正浮点数
    decmal2: "^-\\d*\\.\\d+$", //负浮点数
    money: "^[1-9][0-9]*(\\.[0-9]{1,2})?$", //货币
    email: "^\\w+((-\\w+)|(\\.\\w+))*\\@[A-Za-z0-9]+((\\.|-)[A-Za-z0-9]+)*\\.[A-Za-z0-9]+$", //邮件
    emailgroup: "^(\\w+((-\\w+)|(\\.\\w+))*\\@[A-Za-z0-9]+((\\.|-)[A-Za-z0-9]+)*\\.[A-Za-z0-9]+,)*\\w+((-\\w+)|(\\.\\w+))*\\@[A-Za-z0-9]+((\\.|-)[A-Za-z0-9]+)*\\.[A-Za-z0-9]+$", //邮件群
    color: "^[a-fA-F0-9]{6}$", //颜色
    url: "^http[s]?:\\/\\/([\\w-]+\\.)+[\\w-]+([\\w-./?%&=]*)?$", //url
    domain: "^http[s]?:\\/\\/([\\w-]+\\.)+[\\w-]+(:[1-9][0-9]*)?$", //domain
    chinese: "^[\\u4E00-\\u9FA5\\uF900-\\uFA2D]+$", //仅中文
    ascii: "^[\\x00-\\xFF]+$", //仅ACSII字符
    zipcode: "^\\d{6}$", //邮编
    mobile: "^(13|15|18|17)[0-9]{9}$", //手机
    ip4: "^(\\d{1,2}|1\\d\\d|2[0-4]\\d|25[0-5]).(\\d{1,2}|1\\d\\d|2[0-4]\\d|25[0-5]).(d{1,2}|1\\d\\d|2[0-4]\\d|25[0-5]).(\\d{1,2}|1\\d\\d|2[0-4]\\d|25[0-5])$", //ip地址
    notempty: "^\\S+$", //非空
    picture: "(.*)\\.(jpg|bmp|gif|ico|pcx|jpeg|tif|png|raw|tga)$", //图片
    rar: "(.*)\\.(rar|zip|7zip|tgz)$", //压缩文件
    date: "^\\d{4}(\\-|\\/|\.)\\d{1,2}\\1\\d{1,2}$", //日期
    datetime: "^\\d{4}(\\-)(\\d{2})\\1\\d{2} \\d{2}:\\d{2}:\\d{2}$", //长日期
    qq: "^[1-9]*[1-9][0-9]*$", //QQ号码
    tel: "(\\d{3}-|\\d{4}-)?(\\d{8}|\\d{7})", //国内电话
    username: "^[A-Za-z]+[A-Za-z0-9\\-\\_]*$", //可以是英文、数字、-、_
    letter: "^[A-Za-z]+$", //字母
    letter_u: "^[A-Z]+$", //大写字母
    letter_l: "^[a-z]+$", //小写字母
    idcard: "^[1-9]([0-9]{13}|[0-9]{16})[0-9a-zA-Z]$"//身份证
};
function regexCheck(str,type){ 
	var t_reg = new RegExp(regexEnum[type]);
	return t_reg.test(str);
}