<?php
//中文语言包
return [
    //错误提示
	'err0001'        => '用户名/手机/邮箱至少需要一项',
	'err0002'        => '用户名已被其它用户使用',
	'err0003'        => '此手机已绑定其它用户',
	'err0004'        => '此邮箱已绑定其它用户',
	'err0005'        => '密码不能为空',
	'err0006'        => '昵称不能为空',
	'err0007'        => '请正确填写手机/邮箱/用户名',
	'err0008'        => '请输入要验证的帐号',
	'err0009'        => '创建用户失败',
	'err0010'        => '绑定数据失败',
	'err0011'        => '找不到对应的绑定数据',
	'err0012'        => '找不到对应的用户',
	'err0013'        => '密码错误',
	'err0014'        => '帐户或密码错误',
	'err0015'        => '帐户错误',
	
	'err0016'        => '请输入旧密码',
	'err0017'        => '请输入新密码',
	'err0018'        => '新密码不能与旧密码相同',
	'err0019'        => '请再输入一次新密码',
	'err0020'        => '两次输入的新密码不同',
	'err0021'        => '旧密码错误',
	
	'err0022'        => '旧手机号错误',
	'err0023'        => '请填写正确的手机号',
	'err0024'        => '手机号不能与旧手机号相同',
	
	'err0025'        => '请填写正确的邮箱',
	'err0026'        => '用户名可以为字母开头的，字母、数字、下划线_、破折号-的组合',
	'err0027'        => '昵称可以为汉字、字母、数字和下划线_及破折号-',
	'err0028'        => '密码不能少于6位',
	'err0029'        => '请选择正确的性别',
	'err0030'        => '用户名不能为空',
	
	'log|login'				=>'登录',
	'log|logout'			=>'退出',
	'log|adduser'			=>'新建用户',
	'log|deluser'			=>'删除用户',
	'log|saveuser'			=>'修改用户',
	'log|login|admin'		=>'登录后台',
	'log|logout|admin'		=>'退出后台',
	
	'thank join'     => '感谢您的加入',
	'thank trust'     => '感谢您的信任',
	'come back'     => '欢迎回来',
	'bye bye'     => '记得常回来看看哦',
	
];
